БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлановыеСтатьиЗатратИДоходов</Name>
			<Comment>Бюджетирование грузоперевозок</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_ВариантыБюджетовПоЗаявкам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьиПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыСтатейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаКурсаДляПроверки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Сумма, включая НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРуб</Name>
					<Comment>Сумма, включая НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСРуб</Name>
					<Comment>Сумма НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРуб</Name>
					<Comment>Сумма без НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДнейПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>Учитывать НДСВСебестоимости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов/Forms/ФормаПрогнозаОплаты/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Параметры.Свойство("Владелец", 			 			Владелец);
	Параметры.Свойство("ВариантПрогноза", 			 	ВариантПрогноза);
	Параметры.Свойство("ПрогнозКонтрольнаяДата", 	 	ПрогнозКонтрольнаяДата);
	Параметры.Свойство("ПрогнозКоличествоДней", 	 	ПрогнозКоличествоДней);
	Параметры.Свойство("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	Параметры.Свойство("ПрогнозДата", 					ПрогнозДата);  
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Элементы.ВариантПрогноза.СписокВыбора.Добавить(2, "фиксированная дата");
	КонецЕсли; 
	
	ЗаполнитьСписокДоступныхПараметров(Владелец); 
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокДоступныхПараметров(ВладелецСтатьи)
	
	МассивДоступныхПарамтеров = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ПолучитьМассивДоступныхПарамтеровОбъекта(ВладелецСтатьи);	
	СписокДоступныхПараметров.ЗагрузитьЗначения(МассивДоступныхПарамтеров);

КонецПроцедуры     

&НаКлиенте
Процедура ПрогнозКонтрольнаяДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОтбора = Новый Структура;
	ДанныеОтбора.Вставить("Ссылка", СписокДоступныхПараметров.ВыгрузитьЗначения());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ДанныеОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыФормы, Элемент, ,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозКонтрольнаяДатаПриИзменении(Элемент)
	
	КонтрольВыбранногоПараметра();       

КонецПроцедуры  

&НаСервере
Процедура КонтрольВыбранногоПараметра() 
	
	Если Не ЗначениеЗаполнено(ПрогнозКонтрольнаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокДоступныхПараметров.НайтиПоЗначению(ПрогнозКонтрольнаяДата)	= Неопределено Тогда
		Элементы.ПрогнозКонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		Элементы.ПрогнозКонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	Отказ = Ложь;
	Если ВариантПрогноза = 1 и Не ЗначениеЗаполнено(ПрогнозКонтрольнаяДата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена контрольная дата",,"ПрогнозКонтрольнаяДата",,Отказ);
	КонецЕсли; 
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПрогнозОплатыСтатьиБюджета();  

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВариантПрогноза", 		 	ВариантПрогноза);
	СтруктураОтвета.Вставить("ПрогнозКонтрольнаяДата", 	 	ПрогнозКонтрольнаяДата);
	СтруктураОтвета.Вставить("ПрогнозКоличествоДней", 	 	ПрогнозКоличествоДней);
	СтруктураОтвета.Вставить("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	СтруктураОтвета.Вставить("ПрогнозДата", 				ПрогнозДата); 
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПрогнозаПриИзменении(Элемент)
	
	ВариантПрогнозаПриИзмененииНаСервере(); 
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьВидимостьЭлементов() 
	
	Элементы.ПрогнозКонтрольнаяДата.Видимость 		= ВариантПрогноза = 1;
	Элементы.ДекорацияПлюс.Видимость 				= ВариантПрогноза = 1;
	Элементы.ПрогнозКоличествоДней.Видимость 		= ВариантПрогноза = 1 или ВариантПрогноза = 0;
	Элементы.ДекорацияИли.Видимость 				= ВариантПрогноза = 1;
	Элементы.ПрогнозКоличествоДнейПлан.Видимость 	= ВариантПрогноза = 1;
	
	Элементы.ПрогнозаДата.Видимость 				= ВариантПрогноза = 2;  
	
КонецПроцедуры

&НаСервере
Процедура ВариантПрогнозаПриИзмененииНаСервере() 
	
	ПрогнозКонтрольнаяДата = Неопределено;
	ПрогнозКоличествоДней  = 0;
	ПрогнозКоличествоДнейПлан = 0;	

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрогнозОплатыСтатьиБюджета() 
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПеревозки = Владелец.ДатаСделкиФ;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ВариантПрогноза", 			ВариантПрогноза);
	ПараметрыРасчета.Вставить("Владелец", 					Владелец);
	ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	ПрогнозКонтрольнаяДата);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		ПрогнозКоличествоДней);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	
	ПараметрыРасчета.Вставить("ПрогнозДата",	 			ПрогнозДата);
	ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		ДатаНачалаПеревозки);

	НовыйПрогнозДата = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета); 
	Если НовыйПрогнозДата <> Неопределено 
		И НовыйПрогнозДата <> ПрогнозДата Тогда
		ПрогнозДата = НовыйПрогнозДата;   
	КонецЕсли;
	
КонецПроцедуры
